ЛИС2/src/Documents/ПравоВодоотведения/ПравоВодоотведения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПравоВодоотведения</name>
  <comment>В документе содержатся сведения о правах организации по водоотведению.</comment>
  <registerRecords>InformationRegister.НормативныеОбъемыСбросовВВодныеОбъекты</registerRecords>
  <registerRecords>InformationRegister.КонцентрацииЗВВМестахСбросаСточныхВод</registerRecords>
  <registerRecords>InformationRegister.НормативнаяКонцентрацияЗагрязняющихВеществПоВыпускамВВоду</registerRecords>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>EnumRef.ВидыПраваПотребленияОтведенияИспользованияВоды</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НадзорныйОрган</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводственнаяПлощадка</name>
    <type>
      <types>CatalogRef.ПроизводственныеПлощадки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВодохозяйственныйУчасток</name>
    <type>
      <types>CatalogRef.ВодохозяйственныеУчастки</types>
    </type>
  </attributes>
  <attributes>
    <name>Поквартально</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГидрографическаяЕдиница</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГидрографическаяЕдиницаКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеРазрешительногоДокумента</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВодныйОбъект</name>
    <type>
      <types>DefinedType.ИсточникиПриемникиВод</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЛицензии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерияЛицензии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛицензияВид</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Посуточно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Выпуски</name>
    <attributes>
      <name>Выпуск</name>
      <type>
        <types>CatalogRef.ВыпускиВВоду</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемДопустимогоСброса</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемДопустимогоСбросаПосуточно</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>9</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемДопустимогоСбросаВисокосныйГод</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемДопустимогоСброса1Квартал</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемДопустимогоСброса1КварталВисокосныйГод</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемДопустимогоСброса2Квартал</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемДопустимогоСброса3Квартал</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемДопустимогоСброса4Квартал</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КатегорияКачества</name>
      <type>
        <types>CatalogRef.КатегорииКачестваВоды</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТаблицаЗагрязняющихВеществ</name>
    <attributes>
      <name>ВыпускВВоду</name>
      <type>
        <types>CatalogRef.ВыпускиВВоду</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗагрязняющееВещество</name>
      <type>
        <types>CatalogRef.ЗВВода</types>
        <types>CatalogRef.КонтролируемыеПоказателиВВоде</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОКЕИ</types>
      </type>
    </attributes>
    <attributes>
      <name>НормативноДопустимыйСброс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>23</precision>
          <scale>11</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УстановленныйЛимитНаСброс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>23</precision>
          <scale>11</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонцентрацияЗВВМестеСбросаСточныхВод</name>
    <attributes>
      <name>ВыпускВВоду</name>
      <type>
        <types>CatalogRef.ВыпускиВВоду</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗагрязняющееВещество</name>
      <type>
        <types>CatalogRef.ЗВВода</types>
        <types>CatalogRef.КонтролируемыеПоказателиВВоде</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОКЕИ</types>
      </type>
    </attributes>
    <attributes>
      <name>ТочкаКонтроля</name>
      <type>
        <types>CatalogRef.ТочкиКонтроля</types>
      </type>
    </attributes>
    <attributes>
      <name>Концентрация</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>23</precision>
          <scale>11</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЛицензионныеУсловия</name>
    <attributes>
      <name>Условие</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ГУИДУсловия</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ЛИС2/src/InformationRegisters/НормативныеОбъемыСбросовВВодныеОбъекты/НормативныеОбъемыСбросовВВодныеОбъекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НормативныеОбъемыСбросовВВодныеОбъекты</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФункциональнаяЗона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПроизводственнаяПлощадка</name>
    <type>
      <types>CatalogRef.ПроизводственныеПлощадки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВодныйОбъект</name>
    <type>
      <types>DefinedType.ИсточникиПриемникиВод</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВыпускВВоду</name>
    <type>
      <types>CatalogRef.ВыпускиВВоду</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КатегорияКачестваВоды</name>
    <type>
      <types>CatalogRef.КатегорииКачестваВоды</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОкончанияДействияНорматива</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ЛИС2/src/InformationRegisters/НормативнаяКонцентрацияЗагрязняющихВеществПоВыпускамВВоду/НормативнаяКонцентрацияЗагрязняющихВеществПоВыпускамВВоду.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НормативнаяКонцентрацияЗагрязняющихВеществПоВыпускамВВоду</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>КонцентрацияНорматив</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>23</precision>
        <scale>11</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КонцентрацияЛимит</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>23</precision>
        <scale>11</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияДействияНорматива</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФункциональнаяЗона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПроизводственнаяПлощадка</name>
    <type>
      <types>CatalogRef.ПроизводственныеПлощадки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВодныйОбъект</name>
    <type>
      <types>DefinedType.ИсточникиПриемникиВод</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВыпускВВоду</name>
    <type>
      <types>CatalogRef.ВыпускиВВоду</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗагрязняющееВещество</name>
    <type>
      <types>CatalogRef.ЗВВода</types>
      <types>CatalogRef.КонтролируемыеПоказателиВВоде</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ЛИС2/src/InformationRegisters/КонцентрацииЗВВМестахСбросаСточныхВод/КонцентрацииЗВВМестахСбросаСточныхВод.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонцентрацииЗВВМестахСбросаСточныхВод</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Концентрация</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>23</precision>
        <scale>11</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияДействияНорматива</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВодныйОбъект</name>
    <type>
      <types>DefinedType.ИсточникиПриемникиВод</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВыпускВВоду</name>
    <type>
      <types>CatalogRef.ВыпускиВВоду</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТочкаКонтроля</name>
    <type>
      <types>CatalogRef.ТочкиКонтроля</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗагрязняющееВещество</name>
    <type>
      <types>CatalogRef.ЗВВода</types>
      <types>CatalogRef.КонтролируемыеПоказателиВВоде</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ЛИС2/src/Documents/ПравоВодоотведения/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.НормативныеОбъемыСбросовВВодныеОбъекты.Записывать = Истина;
	
	Для Каждого ТекСтрока Из Выпуски Цикл
		
		КоличествоЛет	 = Год(ЭтотОбъект.ДатаОкончания) - Год(ЭтотОбъект.ДатаНачала) + 1;
		ЧислоМесяцев	 = 0;
		
		Если ЭтотОбъект.Поквартально Тогда
			
			Пока КоличествоЛет > 0 Цикл
				
				НомерКвартала = ?(ЧислоМесяцев <> 0, 1, ?(Цел(Месяц(ДатаНачала) / 3) = Месяц(ДатаНачала) / 3, Месяц(ДатаНачала) / 3, Цел(Месяц(ДатаНачала) / 3) + 1));
				
				Пока НомерКвартала < 5 Цикл 
					
					Если ТекСтрока["ОбъемДопустимогоСброса" + НомерКвартала + "Квартал"] > 0 Тогда
						
						Если НачалоКвартала(ДобавитьМесяц(ЭтотОбъект.ДатаНачала, ЧислоМесяцев)) > ЭтотОбъект.ДатаОкончания Тогда
							
							Прервать;
							
						КонецЕсли;
						
						ДвижениеРегистраОбъемов = Движения.НормативныеОбъемыСбросовВВодныеОбъекты.Добавить();
						
						ЗаполнитьЗначенияСвойств(ДвижениеРегистраОбъемов, ЭтотОбъект);
						ЗаполнитьЗначенияСвойств(ДвижениеРегистраОбъемов, ТекСтрока);
						
						ДвижениеРегистраОбъемов.ВодныйОбъект = ВодныйОбъект;
						ДвижениеРегистраОбъемов.ВыпускВВоду	 = ТекСтрока.Выпуск;
						
						Период								 = НачалоКвартала(ДобавитьМесяц(ЭтотОбъект.ДатаНачала, ЧислоМесяцев));
						
						ДвижениеРегистраОбъемов.Период		 = ?(Период < ЭтотОбъект.ДатаНачала, ЭтотОбъект.ДатаНачала, Период);
						
						Если ПолучитьФункциональнуюОпцию("ВестиКонтрольПосуточногоЗабораВоды")
							И ЭтотОбъект.Посуточно
							И ДеньГода(КонецГода(ДвижениеРегистраОбъемов.Период)) = 366
							И НомерКвартала = 1 Тогда
							
							ДвижениеРегистраОбъемов.Объем = ТекСтрока["ОбъемДопустимогоСброса1КварталВисокосныйГод"];
							
						Иначе
							
							ДвижениеРегистраОбъемов.Объем = ТекСтрока["ОбъемДопустимогоСброса" + НомерКвартала + "Квартал"];
							
						КонецЕсли;
						
						ДатаОкончанияДействияНорматива							 = КонецКвартала(ДобавитьМесяц(ЭтотОбъект.ДатаНачала, ЧислоМесяцев));
						
						ДвижениеРегистраОбъемов.ДатаОкончанияДействияНорматива	 = ?(ДатаОкончанияДействияНорматива > ЭтотОбъект.ДатаОкончания, КонецДня(ЭтотОбъект.ДатаОкончания), ДатаОкончанияДействияНорматива);
						ДвижениеРегистраОбъемов.КатегорияКачестваВоды			 = ТекСтрока.КатегорияКачества;
						
					КонецЕсли;
					
					НомерКвартала	 = НомерКвартала + 1;
					ЧислоМесяцев	 = ЧислоМесяцев + 3;
					
				КонецЦикла;
				
				КоличествоЛет = КоличествоЛет - 1;
				
			КонецЦикла;
			
		Иначе
			
			Пока КоличествоЛет > 0 Цикл
				
				ДвижениеРегистраОбъемов = Движения.НормативныеОбъемыСбросовВВодныеОбъекты.Добавить();
				
				ЗаполнитьЗначенияСвойств(ДвижениеРегистраОбъемов, ЭтотОбъект);
				ЗаполнитьЗначенияСвойств(ДвижениеРегистраОбъемов, ТекСтрока);
				
				ДвижениеРегистраОбъемов.ВыпускВВоду  = ТекСтрока.Выпуск;
				ДвижениеРегистраОбъемов.ВодныйОбъект = ВодныйОбъект;
				
				Период								 = НачалоГода(ДобавитьМесяц(ЭтотОбъект.ДатаНачала, ЧислоМесяцев));
				
				ДвижениеРегистраОбъемов.Период		 = ?(Период < ЭтотОбъект.ДатаНачала, ЭтотОбъект.ДатаНачала, Период);;
				
				Если ПолучитьФункциональнуюОпцию("ВестиКонтрольПосуточногоЗабораВоды")
					И ЭтотОбъект.Посуточно
					И ДеньГода(КонецГода(ДвижениеРегистраОбъемов.Период)) = 366 Тогда
					
					ДвижениеРегистраОбъемов.Объем = ТекСтрока.ОбъемДопустимогоСбросаВисокосныйГод;
					
				Иначе
					
					ДвижениеРегистраОбъемов.Объем = ТекСтрока.ОбъемДопустимогоСброса;
					
				КонецЕсли;
				
				ДатаОкончанияДействияНорматива							 = КонецГода(ДобавитьМесяц(ЭтотОбъект.ДатаНачала, ЧислоМесяцев));
				
				ДвижениеРегистраОбъемов.ДатаОкончанияДействияНорматива	 = ?(ДатаОкончанияДействияНорматива > ЭтотОбъект.ДатаОкончания, КонецДня(ЭтотОбъект.ДатаОкончания), ДатаОкончанияДействияНорматива);
				ДвижениеРегистраОбъемов.КатегорияКачестваВоды			 = ТекСтрока.КатегорияКачества;
				
				ЧислоМесяцев	 = ЧислоМесяцев + 12;
				КоличествоЛет	 = КоличествоЛет - 1;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Движения.НормативнаяКонцентрацияЗагрязняющихВеществПоВыпускамВВоду.Записывать = Истина;
	
	Для Каждого ТекущаяСтрока Из ТаблицаЗагрязняющихВеществ Цикл
		
		ДвижениеРегистраКонцентраций	 = Движения.НормативнаяКонцентрацияЗагрязняющихВеществПоВыпускамВВоду.Добавить();
		СтруктураЗаполненияКонцентраций	 = Новый Структура("Период, ВодныйОбъект, КонцентрацияНорматив, КонцентрацияЛимит, ДатаОкончанияДействияНорматива", 
			ДатаНачала, ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущаяСтрока.ВыпускВВоду, "ВодныйОбъект"), ТекущаяСтрока.НормативноДопустимыйСброс, ТекущаяСтрока.УстановленныйЛимитНаСброс, ДатаОкончания);
		
		ЗаполнитьЗначенияСвойств(ДвижениеРегистраКонцентраций, ЭтотОбъект);
		ЗаполнитьЗначенияСвойств(ДвижениеРегистраКонцентраций, ТекущаяСтрока);
		ЗаполнитьЗначенияСвойств(ДвижениеРегистраКонцентраций, СтруктураЗаполненияКонцентраций);
		
	КонецЦикла;
	
	// ДАВ 20.11.15 ++
	РегистрыСведений.ДанныеКалендаряЭколога.УдалитьЗапись(Ссылка);
	РегистрыСведений.ДанныеКалендаряЭколога.ДобавитьЗапись(Ссылка, Перечисления.ВидыСобытийКалендаряЭколога.ИстекСрокДействияРазрешительногоДокумента, ДатаОкончания, Перечисления.ТипыДокументовДляСроковПоКалендарюЭколога.ПравоВодоотведения);	
	// --
	
	Движения.КонцентрацииЗВВМестахСбросаСточныхВод.Записывать = Истина;
	
	Для Каждого СтрокаКонцентрацияВМестеСброса Из КонцентрацияЗВВМестеСбросаСточныхВод Цикл 
		
		Движение = Движения.КонцентрацииЗВВМестахСбросаСточныхВод.Добавить();
		
		Движение.Период							 = ДатаНачала;
		Движение.Организация					 = Организация;
		Движение.ВодныйОбъект					 = ВодныйОбъект;
		Движение.ВыпускВВоду					 = СтрокаКонцентрацияВМестеСброса.ВыпускВВоду;
		Движение.ЗагрязняющееВещество			 = СтрокаКонцентрацияВМестеСброса.ЗагрязняющееВещество;
		Движение.ТочкаКонтроля					 = СтрокаКонцентрацияВМестеСброса.ТочкаКонтроля;
		Движение.Концентрация					 = СтрокаКонцентрацияВМестеСброса.Концентрация;
		Движение.ДатаОкончанияДействияНорматива	 = ДатаОкончания;
		
	КонецЦикла; // Для Каждого СтрокаКонцентрацияВМестеСброса Из КонцентрацияЗВВМестеСбросаСточныхВод Цикл	
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ЗаполнениеДокументовСправочников.ЗаполнитьДокумент(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)	
	
	Если ОбменДанными.Загрузка Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если НЕ Поквартально Тогда
		
		Для каждого СтрокаВыпуск Из Выпуски Цикл
			
			СтрокаВыпуск.ОбъемДопустимогоСброса1Квартал = 0;
			СтрокаВыпуск.ОбъемДопустимогоСброса2Квартал = 0;
			СтрокаВыпуск.ОбъемДопустимогоСброса3Квартал = 0;
			СтрокаВыпуск.ОбъемДопустимогоСброса4Квартал = 0;
			
		КонецЦикла;
		
	КонецЕсли;
	
	// 1С-КСУ Казанцев И.В. 10.04.17 13:30 Добавление ГУИД для каждой строки условия для связи с отчетом.
	Для Каждого ТекСтрокаУсловия Из ЛицензионныеУсловия Цикл
		Если Не ЗначениеЗаполнено(ТекСтрокаУсловия.ГУИДУсловия) Тогда
			НовыйГУИД = Новый УникальныйИдентификатор;
			ТекСтрокаУсловия.ГУИДУсловия = НовыйГУИД;
		КонецЕсли;
	КонецЦикла;
	// 1С-КСУ Казанцев И.В. 10.04.17 13:30 Добавление ГУИД для каждой строки условия для связи с отчетом. Конец.
КонецПроцедуры    

Процедура ПриЗаписи( Отказ )

// 1СКСУ - Казанцев И.В. 19.01.17 10:50
// При провере АПК не обнаружена конструкция "Если ОбменДанными.Загрузка Тогда ...".
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли; 
// 1СКСУ - Казанцев И.В. 19.01.17 10:50 Конец
	
	// Работа с бизнес-процессами
	Если Обработки.СозданиеНСИ.ИспользоватьМеханизмБизнесПроцессов( Ссылка ) И Не Проведен Тогда
		Обработки.СозданиеНСИ.ЗапуститьБизнесПроцессСогласования( Ссылка );
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередУдалением( Отказ )

// 1СКСУ - Казанцев И.В. 19.01.17 10:50
// При провере АПК не обнаружена конструкция "Если ОбменДанными.Загрузка Тогда ...".
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли; 
// 1СКСУ - Казанцев И.В. 19.01.17 10:50 Конец
	
	// Работа с бизнес-процессами
	Если Обработки.СозданиеНСИ.ИспользоватьМеханизмБизнесПроцессов( Ссылка ) Тогда
		Если Не Обработки.СозданиеНСИ.ЭлементДоступенДляРедактирования( Ссылка ) Тогда 
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
	
#КонецЕсли
